src/Catalogs/Котики/Котики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Котики</name>
  <attributes>
    <name>Возраст</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Болезни</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотоВывод</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусНахождения</name>
    <type>
      <types>EnumRef.СтатусНахождения</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Котики/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура Загрузить(Команда)               
	// Извлекаем Файл из пути
	Файл = Новый Файл(Объект.ПутьКФайлу);
	
	// Проверяем что он действительно существует
	Если Файл.Существует() Тогда
		// Преобразуем его по пути в двоичные данные
		ДД = Новый ДвоичныеДанные(Объект.ПутьКФайлу); 
		// И загружаем на сервер преобразованные двоичные данные
		ЗагрузитьНаСервере(ДД);
		
		ЭтаФорма.Модифицированность = Ложь;
		ОбновитьКартинку();
		Объект.ФотоВывод = "Да";
	Иначе
		Сообщить("Выберите файл картинки");
	КонецЕсли
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(ДД)
	Хранилище = Новый ХранилищеЗначения(ДД);
	// Преобразуем реквизит формы в объект
	Об = РеквизитФормыВЗначение("Объект");
	
	// Передаем изображение из хранилища в реквизит "Картинка"
	Об.Фотография = Хранилище;
	
	// Записываем изображение
	Об.Записать();
	
	//И преобразуем его в реквизит.
	ЗначениеВРеквизитФормы(Об,"Объект");
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартинку()
	Картинка = ПоместитьВоВременноеХранилище
		(Объект.Ссылка.Фотография.Получить(),
		УникальныйИдентификатор);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.ФотоВывод = "Да" Тогда
		ОбновитьКартинку();
	Иначе
		//Если изображение не загружалось еще, то вместо картинки загружаем во временное хранилище заглушку
		Картинка = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.ЗаглушкаКотик, УникальныйИдентификатор);
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Заголовок = "Выберите картинку для загрузки";
	Диалог.Фильтр = "Файл JPG, PNG, JPEG |*.jpg; *.png; *.jpeg";
	Если Диалог.Выбрать() Тогда
		Объект.ПутьКФайлу = Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//РезультатПроверки = ПроверитьУникальностьИмени(Объект.Наименование);
	//Если ЗначениеЗаполнено(РезультатПроверки) Тогда
	//	Сообщить("Имя не уникально!");
	//	Отказ = Истина;
	//КонецЕсли
КонецПроцедуры

&НаСервере
Функция ПроверитьУникальностьИмени(Имя)
	Возврат Справочники.Котики.НайтиПоНаименованию(Имя);
КонецФункции
